<template>
    <div class="agreement-page">
        <h2 class="flex justify-center font-bold">信息授权书</h2>
        <p class="indent-0">重要提示：</p>
        <p>
            为了保障您的合法权益，您应当阅读并遵守本授权书。请您务必审慎阅读、充分理解本授权书所有条款，对本授权书中与您的权益存在重大关系的条款，已采用粗体字进行标注提示您特别注意。<span
                class="font-bold"
                >如您点击“同意”,即表示您已同意本授权书的全部内容，并同意北京天安未来科技有限公司（以下筒称“天安未来”）及天安未来合作的相关第三方按照本授权书进行采集、传输、使用和存储您及以您为法人代表的企业（以下简称“企业”）的下述信息。您同意并且确认，在您（包括您的授权代理人，下同）同意接受本授权书并申请开通相关业务功能时，天安未来及相关第三方有理由相信您是具有完全民事行为能力、能够独立承担民事责任的自然人。如不具备前述条件，本人应立即停止申请使用本服务。</span
            >
        </p>
        <p>北京天安未来科技有限公司及天安未来合作的第三方公司（以下简称“被授权人”）：</p>
        <p class="font-bold">本人自愿使用被授权人提供的服务，同意并授权如下：</p>
        <p>
            一、本人通过被授权人开通电子账户并办理业务，为便捷、顺畅地完成交易，本人理解并自愿授权被授权人采集本人的<span
                class="font-bold"
                >姓名、身份证号、手机号码、所属企业名称、工号等</span
            >必要信息。
        </p>
        <p>
            二、本人已知悉并同意被授权人采集并传输<span class="font-bold">人脸信息</span
            >用于开立账户时对本人身份进行核实，被授权人收集并保存本人的人脸信息，并通过本人提供的人脸信息与法律法规或政府机关授权的机构所保存身份证件信息进行比对核验完成身份核验。
        </p>
        <p class="font-bold">本人知悉并同意：</p>
        <p>
            一、人脸信息仅作为被授权人识别本人身份的辅助手段，不视为身份识别的唯一依据。被授权人将在现有技术能力基础上不断提升人脸识别的准确性。但因人脸信息容易受个体、设备、光线等多种不特定因素影响，被授权人无法保证每次的人脸识别均能验证成功。
        </p>
        <p>
            二、<span class="font-bold"
                >在使用人脸识别方式办理各项业务时，本人应仔细确认各项交易信息后再提交办理。本人不以非本人意愿等原因要求天安未来或第三方承担其他责任。</span
            >
        </p>
        <p>
            三、<span class="font-bold"
                >本授权书经本人在线确认同意即视为签署本授权书并立即生效，至双方业务关系按约履行完毕后止</span
            >。双方业务关系终止后，被授权人根据监管对客户身份资料及交易记录的保存要求，对本人的个人身份信息自业务关系结束当年计起至少保存5
            年。
        </p>
        <p>
            四、被授权人重视对本人的信息保护，遵循合法、正当、必要的原则，依照法律法规严格保护本人的个人信息。在未经本人同意和确认的情况下，除国家法律法规或者有权机关依法要求提供之外，被授权人不会向其他任何公司、组织和个人披露本人的个人信息。被授权人将严格遵守相关法律规定及监管要求，采取有效措施加强个人信息保护，确保信息安全，防止信息泄露和滥用。<span
                class="font-bold"
                >本人完全知悉上述授权可能给本人带来的风险</span
            >，这些风险包括但不限于：本人信息有可能被泄露及不当利用而给本人带来不利影响。本人仍自愿同意上述授权，自愿承担相关风险。
        </p>
        <p>
            五、为了保护本人及他人合法权益，被授权人有权基于版本升级、服务内容变动、操作流程变动等，修改本授权书的相关条款并通过被授权人的服务平台等渠道进行公告。如继续使用相关服务且同意授权，即认为本人已接收修改后的授权书内容。如果不同意授权书的相关修改，本人有权立即停止使用被授权人提供的相关服务。被授权人有权基于法律法规变化，监管政策变化，停止向本人提供服务。
        </p>
        <p>
            六、若本人与被授权人发生任何纠纷或争议，首先应友好协商解决；协商不成的，<span class="font-bold"
                >本人同意将纠纷争议提交被授权人天安未来所在地有管辖权的人民法院管辖</span
            >。本授权书的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
        </p>
        <p>
            七、本人已知悉本授权书所有内容（特别是加粗字体内容）的意义以及由此产生的法律效力，自愿作出上述授权，本授权书是本人真实的意思表示，本人同意承担由此带来的一切法律后果。
        </p>
        <p>
            为此，本人理解并同意，被授权人及上述涉及机构有权获取、分析、使用本人上述信息，处理结果可能会影响本人接受的被授权人业务及服务。
        </p>
    </div>
</template>
<script>
export default {
    name: 'Agreement',
    props: {},
    data() {
        return {}
    },
    methods: {}
}
</script>

<style lang="scss" scoped>
.agreement-page {
    padding: 20px;
    h2 {
        font-size: 20px;
        margin-bottom: 10px;
    }
    p {
        font-size: 15px;
        line-height: 26px;
        margin-bottom: 10px;
        text-indent: 30px;
        &.indent-0 {
            text-indent: 0;
        }
    }
}
</style>
